[
    {
        "id" : "greg-conner",        
        "image" : "assets/employee_icons/new/greg_conner1.png",
        "phone" : "(762) 685 - 5366",
        "email" : "greg.conner@wrdw.com",
        "name" : "Greg Conner",
        "title" : "Greg Conner",
        "position": "General Sales Manager",
        "bio" : "I have been in the media business for 28 years, 4 years in newspaper and 24 in Broadcast TV. \n\nDuring those 28 years, I have worked Asheville, NC, Las Vegas, NV, Greensboro, NC, Columbia, SC, Albany, GA, Macon, GA and Augusta, GA.\n\nWhile in broadcast TV, I have held the positions of Local Account Executive, National Account Executive, Local Sales Manager, Director of Sales and General Manager.\n\nMy philosophy has always been, be transparent, build trust, and be a partner, not just a sales person. Nothing makes me happier than helping my clients (partners) achieve their goals.\n\nEven as a General Manager, I love going to visit clients and educating them in the ways Gray Marketing Augusta can help them grow their business and achieve their goals.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "jennifer-dixon",        
        "image" : "assets/employee_icons/new/jennifer_dixon1.png",
        "phone" : "(762) 685 - 5302",
        "email" : "jennifer.dixon@wrdw.com",
        "name" : "Jennifer Dixon",
        "title" : "Jennifer Dixon",
        "position": "Sr. Multimedia Sales Manager",
        "bio" : "I pride myself on being a passionate leader, dedicated teammate, and self-proclaimed broadcast veteran, with over 20 years of sales experience here at News 12 26. Born and raised in the CSRA, I’ve built my career on strong relationships, with my team, our clients, and the amazing community I’m lucky to call home. For over 14 years, I’ve served as Executive Producer of the LawCall show on WRDW, where I like to think I’ve helped bring trusted legal insight to viewers. Outside of sales and the late-night legal conversations, I’ve spent more than a decade as an advocate for the American Heart Association, using my charm, and maybe a few persuasive emails/calls, to raise awareness and make a difference. Whether I’m brainstorming with the sales team, guiding a campaign, or helping a client tell their story, I try to bring energy, heart, and a whole lot of coffee to the table. As a wife and proud mom of three, I think I’ve mastered the art of balancing work, family, and the occasional “How is it already Monday?” moment. \n\nEvery day, I show up with one goal: to learn all I can, to make sure my team and our clients have the tools, support, and encouragement they need to succeed, because I want us all to succeed.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "sarah-lefevre",        
        "image" : "assets/employee_icons/new/sarah_lefevre1.png",
        "phone" : "(762) 685 - 5303",
        "email" : "sarah.lefevre@wrdw.com",
        "name" : "Sarah Lefvre",
        "title" : "Sarah Lefvre",
        "position": "Multimedia Sales Manager",
        "bio" : "As a Multimedia Sales Manager at News 12/26, I work with clients who are ready to think bigger, those who want more than just a quick campaign, but a long-term marketing strategy that actually grows their business year over year. I specialize in building holistic plans that connect the dots between branding, website performance, lead generation, and sustainable customer engagement. I believe the best marketing doesn’t just make noise, it builds trust, momentum, and measurable results.\n\nOutside of work, I’m usually on a Pilates reformer or exploring local spots for great Korean food, there’s something about the balance of discipline and delight that fuels my approach to life and business. I bring that same energy to every project: focused, thoughtful, and built to last.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "emerald-greene",        
        "image" : "assets/employee_icons/new/emerald-greene2.png",
        "phone" : "(762) 685 - XXXX",
        "email" : "emerald.greene@wrdw.com",
        "name" : "Emerald Greene",
        "title" : "Emerald Greene",
        "position": "Traffic Manager",
        "bio" : "Married with her beloved fur babies, Emerald brings over 17 years of experience in the broadcast industry. A true expert in all things TV commercial-related, she has a deep understanding of the industry and a passion for delivering results that resonate on screen. Outside of work, she’s is dedicated to inspiring others to prioritize wellness in their everyday lives.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "julie-morgan",        
        "image" : "assets/employee_icons/new/julie_morgan1.png",
        "phone" : "(762) 685 - 5305",
        "email" : "julie.morgan@wrdw.com",
        "name" : "Julie Morgan",
        "title" : "Julie Morgan",
        "position": "Multimedia Sales Coordinator",
        "bio" : "With over 12 years' experience in B2B outside sales, 4 years in both web development and project management, and 2 years in digital marketing, I bring a dynamic blend of experience to the table.  I specialize in leading digital campaigns from initial concept through successful launch, ensuring every detail is optimized for performance. My approach combines strategic insight, technical know-how, and hands-on execution to deliver measurable results.  I value clear, timely communication, efficient workflows, and getting things done expeditiously. Let’s bring your next digital campaign to life - I’m excited to collaborate!",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "brenda-ramsey",        
        "image" : "assets/employee_icons/new/brenda_ramsey1.png",
        "phone" : "(762) 685 - 5305",
        "email" : "brenda.ramsey@wrdw.com",
        "name" : "Brenda Ramsey",
        "title" : "Brenda Ramsey",
        "position": "National Sales Assistant",
        "bio" : "With over 12 years' experience in B2B outside sales, 4 years in both web development and project management, and 2 years in digital marketing, I bring a dynamic blend of experience to the table.  I specialize in leading digital campaigns from initial concept through successful launch, ensuring every detail is optimized for performance. My approach combines strategic insight, technical know-how, and hands-on execution to deliver measurable results.  I value clear, timely communication, efficient workflows, and getting things done expeditiously. Let’s bring your next digital campaign to life - I’m excited to collaborate!",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "susan-deluca",        
        "image" : "assets/employee_icons/new/susan_deluca1.png",
        "phone" : "(762) 685 - 5313",
        "email" : "susan.deluca@wrdw.com",
        "name" : "Susan Deluca",
        "title" : "Susan Deluca",
        "position": "Regional Sales Assistant",
        "bio" : "With two decades of experience in broadcast advertising, I’ve built a strong foundation in media strategy, client service, and campaign execution. Now, I’m diving into digital advertising to expand my skill set and stay ahead in an ever-evolving industry. Building strong, trusted relationships with my buyers is at the heart of what I do. I pride myself on being their go-to resource, someone they can rely on to manage every detail of their on-air campaigns. From strategic negotiations to securing the best placements across our broadcast networks, I’m committed to delivering results that exceed expectations. While I’m confident working independently and getting things done efficiently, I also thrive in a team environment. I collaborate closely with colleagues to make sure our clients receive the best possible experience and results.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "chris-claypool",        
        "image" : "assets/employee_icons/new/chris_claypool1.png",
        "phone" : "(762) 685 - 5310",
        "email" : "chris.claypool@wrdw.com",
        "name" : "Chris Claypool",
        "title" : "Chris Claypool",
        "position": "Media Executive",
        "bio" : "As a business growth expert in Broadcast & Digital Marketing for over 30 years, I’m passionate about crafting data-driven strategies that deliver measurable results.  I have a proven track record of success helping local companies grow their business. And as a graduate of the University of Georgia with a degree in Advertising, I believe in building strong relationships with my clients and working collaboratively to achieve their goals. Let's talk about how I can help your business thrive.\n\nLife Quote: “Be the Bacon”",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "chip-creamer",        
        "image" : "assets/employee_icons/new/chip_creamer1.png",
        "phone" : "(762) 685 - 5309",
        "email" : "chris.claypool@wrdw.com",
        "name" : "Chip Creamer",
        "title" : "Chip Creamer",
        "position": "Media Executive",
        "bio" : "I am a lifelong resident of the CSRA and I have been watching WRDW/WAGT since I was a child growing up in Jackson, SC. I have been working in local television for more than 30 years. I have an extensive background in most aspects of TV including production, creative services, reporting and sales. I write my own scripts and many times do my own voiceovers for commercials. My personal sales philosophy is simple, I treat all clients and potential clients the way I would want to be treated. I listen to the client’s marketing needs and provide a solution that will help them reach projected goals. There is nothing better than to help a client’s business to grow and build long term relationships. One important rule I follow, never promise what you can’t deliver. With technology constantly changing, I am certified by Gray Media, our parent company, to also provide digital marketing solutions for clients in addition to a television schedule. Feel free to contact me and let me help you.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "chandler-johnson",        
        "image" : "assets/employee_icons/new/chandler_johnson1.png",
        "phone" : "(762) 685 - 5312",
        "email" : "chandler.johnson@wrdw.com",
        "name" : "Chandler Johnson",
        "title" : "Chandler Johnson",
        "position": "Media Executive",
        "bio" : "Born and raised in the CSRA, Chandler brings a fresh and energetic perspective to the world of sales, with just over a year of experience under his belt. He’s passionate about making business owners’ lives easier by being a true advocate for their advertising needs. With a strong work ethic and a natural niche for all things sports-related, Chandler is driven, hardworking, and committed to helping clients succeed through smart, effective solutions.",
        "btn": "ADVERTISE WITH US!"
    },
    
    {
        "id" : "alexis-musick",        
        "image" : "assets/employee_icons/new/alexis_musick1.png",
        "phone" : "(762) 685 - 5386",
        "email" : "alexis.musick@wrdw.com",
        "name" : "Alexis Musick",
        "title" : "Alexis Musick",
        "position": "Media Executive",
        "bio" : "Alexis Musick is passionate about helping local businesses grow through strategic storytelling and creative marketing campaigns. With a background in advertising, graphic design, and digital strategy, she brings a unique mix of creativity and business savvy to every project.\n\nAlexis partners closely with each client to understand their goals and develop custom campaigns that deliver results—whether through streaming TV, targeted digital ads, or live interviews on The Morning Mix. She believes every business has a powerful story worth sharing, and she’s dedicated to making sure it reaches the right audience.\n\nWhen she’s not helping clients shine, you’ll find her spending time with her husband and two kids, practicing martial arts, or volunteering through her church. Alexis is proud to be part of a team that puts community first and loves helping local brands make a lasting impact.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "peggy-maddox",        
        "image" : "assets/employee_icons/new/peggy_maddox1.png",
        "phone" : "(762) 685 - 5307",
        "email" : "peggy.maddox@wrdw.com",
        "name" : "Peggy Maddox",
        "title" : "Peggy Maddox",
        "position": "Media Executive",
        "bio" : "Peggy Maddox is a Marketing Executive for Gray Media. With over 40 years of experience, she is dedicated to creating impactful partnerships and campaigns that help businesses grow.\n\nPeggy graduated from Augusta University, on the dean's list, with a marketing degree and initially worked in the advertising agency world where she learned many useful skills. 23 years ago, she got a position at WAGT Television in sales, navigated a few ownership transitions and today works for Gray Media. Peggy is passionate about the power of television to connect advertisers and customers. And even though the landscape changes exponentially quickly these days with so many more options and possibilities, she still believes in innovation and most importantly, collaboration, to achieve common goals.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "zaria-scott",        
        "image" : "assets/employee_icons/new/zaria_scott1.png",
        "phone" : "(762) 685 - 5314",
        "email" : "zaria.scott@wrdw.com",
        "name" : "Zaria Scott",
        "title" : "Zaria Scott",
        "position": "Media Executive",
        "bio" : "Zaria is a proud native of the CSRA area, she combines her deep understanding of the local market with a robust background in business and entrepreneurship to develop integrated advertising campaigns across broadcast and digital platforms. Her approach is professional, results-driven, and centered on clear communication and authentic storytelling. Zaria is committed to building partnerships that deliver measurable impact and resonate with the community she serves.",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "marc-williamson",        
        "image" : "assets/employee_icons/new/marc_williamson1.png",
        "phone" : "(762) 685 - 5311",
        "email" : "marc.williamson@wrdw.com",
        "name" : "Marc Williamson",
        "title" : "Marc Williamson",
        "position": "Media Executive",
        "bio" : "With over 19 years in media, I started at WAGT and grew into roles at both WAGT and WRDW. Today, we’re more than broadcast—we’re a full-service digital agency offering streaming, targeted digital ads, and even digital billboards. I’m not a high-pressure sales rep. I’m a media consultant and true partner, focused on helping your business grow. My goal? For you to look forward to every conversation, knowing I’m bringing fresh ideas that drive results. Born and raised in Augusta, I’ve been married 32 years, with four kids and two grandkids. I love this community—and helping local businesses succeed is what I do best. Let’s talk about how we can take your business to the next level!",
        "btn": "ADVERTISE WITH US!"
    },

    {
        "id" : "kameron-robinson",        
        "image" : "assets/employee_icons/new/kameron_robinson1.png",
        "phone" : "(762) 685 - 5303",
        "email" : "kameron.robinson@wrdw.com",
        "name" : "Kameron Robinson",
        "title" : "Kameron Robinson",
        "position": "Creative Services Director",
        "bio" : "I’ve been in the news industry for 11 years across three states. I began my career just before graduating from the University of St. Francis, where I majored in animation with a minor in communication. My first 5 years in news were spent working in the news production department. I started as a floor director and, over the years, worked my way up to Assistant Newscast Director, Newscast Director, and ultimately Senior Newscast Director.\n\nEven though directing was something I excelled at, I didn’t have a passion for it and still felt drawn to video work. So I decided to step away from the news department for a chance to work in Creative Services, and I haven’t looked back since. After spending 3 years as a Creative Services Producer in Fort Wayne, IN, where my career began, I had the opportunity to take a job in Cleveland, OH, where I was able to sharpen my skills. 3 years in Cleveland taught me so much, and with that knowledge, I decided to take the next step and was accepted into Gray Media’s corporate marketing leadership program.\n\nAfter spending a year learning different aspects of the job, I was happy to accept my first Creative Services Director position here in Augusta. I look forward to using everything I’ve learned in my career to make the most out of every commercial and promo. And most importantly, to collaborate with clients to help their business succeed with creativity and a smile.",
        "btn": "CREATE WITH US!"
    },

    {
        "id" : "kurt-smith",        
        "image" : "assets/employee_icons/new/kurt_smith1.png",
        "phone" : "(762) 685 - XXXX",
        "email" : "kurt.smith@wrdw.com",
        "name" : "Kurt Smith",
        "title" : "Kurt Smith",
        "position": "Creative Services Producer",
        "bio" : "Born in Germany around the time of the country’s reunification, I spent the majority of my childhood years moving back-and-forth between Europe and the United States with my military family. It was during these years that I developed a passion for all things related to film and animation, as well as my solid work ethic and the ability to operate as part of a collective effort. Germany is also where I graduated from high school and earned an associates degree, shortly before returning to the USA one final time to land in the state of Georgia. There I enrolled at SCAD in Savannah to pursue a degree in traditional animation, and after which landed my first job in the industry in the city of Atlanta. My crew and I worked together to produce an animated series for the FX network, but I decided to return home to Augusta following the wrapping up of production on the first season, where I have since joined the staff at WRDW News 12-26.\n\nAs a member of its Creative Services department, I am responsible for filming live-action footage, recording voice-over audio, and editing said assets into commercials and event promos for our station’s sponsors and Sales clients. I also participate in the various non-profit events that are organized by ourselves or other organizations, and I will occasionally offer my expertise to the News team when they require either a camera operator or branding for a new program. During my time in Creative Services, I have learned new and exciting ways to provide engaging marketing material for our clients, as well as collaborating with my supremely talented colleagues to create astounding works and complete our projects well ahead of their deadlines. Garnering a reputation for high quality at a rapid pace and for maintaining composure in high-pressure situations, I eagerly look forward to new challenges in the future as an opportunity for expanding both my knowledge and my growing repertoire of skills.",
        "btn": "CREATE WITH US!"
    },

    {
        "id" : "clayton-richardson",        
        "image" : "assets/employee_icons/new/clayton_richardson1.png",
        "phone" : "(762) 685 - XXXX",
        "email" : "clayton.richardson@wrdw.com",
        "name" : "Clayton Richardson",
        "title" : "Clayton Richardson",
        "position": "Creative Services Producer",
        "bio" : "Hi!\n\nMy name's Clayton. I was born and raised in the CSRA and got my Communication degree at Augusta University. I've been an amateur filmmaker for almost a decade. I love coming up with out of the box ideas and then figuring out how to make those ideas a reality. Video production may be my expertise but I also enjoy drawing, painting, and a little photography here and there. If you want to talk comics, manga, video games, or new advances in technology, you'll have my ear for hours.\n\nOh and cryptids, #BIGFOOTISREAL.",
        "btn": "CREATE WITH US!"
    },

    {
        "id" : "jae-corales",        
        "image" : "assets/employee_icons/new/jae_corales1.png",
        "phone" : "(762) 685 - 5383",
        "email" : "clayton.richardson@wrdw.com",
        "name" : "Jae Florence Corales",
        "title" : "Jae Florence Corales",
        "position": "Creative Services Producer",
        "bio" : "As a multidisciplinary creative with over 10 years of experience in graphic design, photography, and art, I bring bold ideas to life across digital, print, and broadcast platforms. I’m originally from the Philippines and now based in Augusta, Georgia where I continue to blend design with purpose and impact.\n\nI earned my BA in Graphic Design with a minor in Computer Science from Western Illinois University in 2025 and previously studied visual arts at Black Hawk College. My creative journey includes roles as a lead designer for universities, freelance projects under PNTLSTA Creative, and collaborative work within fast-paced media teams. Whether I’m building a brand, producing content, or crafting a campaign, I’m driven by clarity, emotion, and strong visual storytelling.",
        "btn": "CREATE WITH US!"
    }
    
]